#include <mudlib.h>

#define part ({"不明部位","頭部","頸部","胸前","腹部","腰部","背部","手上","腿部"})

mapping meridians = ([
   1:({"手太陰肺經","中府","雲門","俠白","尺澤","孔最","列缺","太淵","少商"}) ,

   2:({"手陽明大腸經","商陽","合谷","陽溪","手三里","曲池","下廉","五里","臂虛",
                      "肩顯","天鼎","服突","迎香"}) ,
                 
   3:({"足陽明胃經","承泣","地倉","頰車","下關","頭維","人迎","水突","氣舍",
                    "缺盆","乳中","乳根","不容","天樞","氣衝","脾關","伏兔",
                    "陰市","梁邱","犢鼻","足三里","豐隆","解溪","厲兌"}) ,

   4:({"足太陰脾經","隱臼","太白","商邱","三陰交","地機","陰陵泉","血海",
                    "箕門","衝門","腹結","大橫","天溪","大包"}) ,

   5:({"手少陰心經","極泉","青靈","少海","靈道","通裡","陰卻","神門","少府",
                    "少衝"}) ,

   6:({"手太陽小腸經","少澤","後溪","陽穀","支正","小海","肩貞","天宗",
                      "秉風","天窗","顴繆","聽宮"}) ,

   7:({"足太陽膀胱經","晴明","攢竹","眉衝","通天","玉枕","天柱","風門",
                      "會陽","附分","神堂","魂門","胃倉","秩邊","承扶",
                      "殷門","委中","合陽","承山","崑崙","至陰"}) ,

   8:({"足少陰腎經","湧泉","水泉","築賓","陰谷","橫骨","氣穴","中注",
                    "陰都","幽門","神封","神藏"}) ,
                 
   9:({"手厥陰心包經","天池","天泉","曲澤","卻門","間使","內關","大陵",
                      "勞宮","中衝"}) ,

  10:({"手少陽三焦經","關衝","中渚","陽池","會宗","天井","虛會","天牖",
                      "翳風","顱息","絲竹空"}) ,

  11:({"足少陽膽經","瞳子繆","聽會","懸釐","率谷","天衝","竅陰","本神",
                    "陽白","目窗","承靈","風池","肩井","淵液","日月",
                    "京門","維道","環跳","風市","陽陵泉","陽交","懸鐘",
                    "丘墟","足陰竅"}) ,

  12:({"足厥陰肝經","大敦","中封","蠡溝","中都","曲泉","五里","陰廉",
                    "急脈","太沖","章門","期門"}) ,

  13:({"督脈","長強","腰陽關","命門","中樞","至陽","靈臺","神道","大椎",
              "風府","百會","前頂","神庭","上星","水溝","兌端"}) ,

  14:({"任脈","會陰","曲骨","關元","氣海","陰交","神闕","建裡","巨闕",
              "膻中","璇磯","天突","廉泉","承漿"}) ,

            ]) ;

//  第一個數字是下針難度, 後面的是穴道所在位置
mapping m_part = ([
                  1 : ({1,3,3,7,7,7,7,7,7}),
                  2 : ({2,7,7,7,7,7,7,7,7,2,2,1}),
                  3 : ({4,1,1,1,1,1,2,2,2,3,3,3,3,4,4,8,8,8,8,8,8,8,8,8}),
                  4 : ({3,8,8,8,8,8,8,8,8,4,4,4,3,5}),
                  5 : ({1,7,7,7,7,7,7,7,7,7}),
                  6 : ({2,7,7,7,7,7,7,6,6,2,1,1}),
                  7 : ({4,1,1,1,1,1,2,6,6,6,6,6,6,6,8,8,8,8,8,8,8}),
                  8 : ({3,8,8,8,8,4,4,4,4,4,3,3}),
                  9 : ({1,3,7,7,7,7,7,7,7,7}),
                 10 : ({2,7,7,7,7,7,7,2,1,1,1}),
                 11 : ({4,1,1,1,1,1,1,1,1,1,1,2,2,5,5,5,4,8,8,8,8,8,8,8}),
                 12 : ({3,8,8,8,8,8,8,8,4,5,3,3}),
                 13 : ({5,0,6,6,6,6,6,6,6,2,1,1,1,1,1}),
                 14 : ({5,0,4,4,4,4,4,4,4,3,3,2,2,1}),                  
                  ])  ; 

string *merid_describ = ({ 
       "" ,
       "\t 肺經主呼吸及氣體交換\n"
       "\t 下針難度 :簡易\n" ,
       "\t 大腸經主消化及排洩\n"
       "\t 下針難度 :進階\n" ,       
       "\t 胃經主消化\n"
       "\t 下針難度 :稍難\n" ,
       "\t 脾經主造血,消化,及吸收,調節血糖\n"
       "\t 下針難度 :中等\n" ,
       "\t 心經主血液循環及大腦皮膚功能\n"
       "\t 下針難度 :簡易\n" ,
       "\t 小腸經主消化,吸收及分清理濁\n"
       "\t 下針難度 :進階\n" ,
       "\t 膀胱經主泌尿及內臟機能\n"
       "\t 下針難度 :稍難\n" ,
       "\t 腎經主生殖,過濾分解及內分泌\n"
       "\t 下針難度 :中等\n" ,
       "\t 心包經主血液循環及大腦皮膚功能\n"
       "\t 下針難度 :簡易\n" ,
       "\t 三焦經主調節生理機能,體液,神經,消炎及大腦機能\n"
       "\t 下針難度 :進階\n" ,
       "\t 肝經主造血,解毒,血液淨化及部份神經\n"
       "\t 下針難度 :稍難\n" ,
       "\t 膽經主消化,輔助調節內臟機能\n"
       "\t 下針難度 :中等\n" ,
       "\t 督脈循脊椎而行,與各臟器均有關連 \n"
       "\t 下針難度 :困難\n" ,
       "\t 任脈為奇經八脈之一,各穴皆有其獨立之作用 \n"
       "\t 下針難度 :困難\n" ,       
                            }) ;                 
// 檢查下針的穴是否存在,通常是先check use_points 中的work_point.
// i 經絡在mapping 中位置, j 是穴道在經絡中的位置
// linit_i limit_j 是 i j 的數目, part_name 是穴道在人體的位置
// ok_flag 1 表死穴,2 為有用穴, 3 為其它存在穴,0 則不存在

int *do_check(string tar_point)
{
       int i,j,limit_i,limit_j,ok_flag,part_name ;
       string point,*temp ;

       ok_flag = 0 ;                  
       limit_i = 15 ;
       for(i=1;i<limit_i;i++)
          {
            temp = meridians[i] ;

            limit_j = sizeof(temp);
            for(j=1;j<limit_j;j++)
               {
                 point=temp[j];
                 if(tar_point==point)
                   { 
                     ok_flag = 3 ;
                     part_name=m_part[i][j] ;
                     break ;
                   }
               }
            if(ok_flag!=0)break ;   
          }      
            
     return ({ ok_flag , part_name }) ;
}

//  傳回全部經絡穴道名稱

mapping query_all_meridians()
{
     return meridians ;
}

//傳回一條經絡的編號及其下針難度

int *query_meridians_no(string arg)
{
    int i,merid_no,merid_diff,*result ;
    
    if(!arg){ return ({ -1,-1 }) ;}
       for(i=1;i<15;i++)
          {
            if(arg == meridians[i][0] )
              {
                  merid_no = i ;
                  merid_diff = m_part[i][0] ;
                  result = ({ merid_no , merid_diff }) ;
                  break ;
               }
            result = ({ -1,-1 }) ;
          }
    return result ;
}

// return a meridians' contains
// 傳回一條經絡所含的全部穴道, 若無傳入值則傳回全部的經絡名.

string *query_meridians(string arg)
{
    int i;
    string *temp;
    temp = ({ "" }) ;

    if(!arg||(arg=="title")||(arg=="total"))
      {
         for(i=1;i<15;i++)
            temp = temp + ({ meridians[i][0] }) ;
      }
    else
      {
         for(i=1;i<15;i++)
            {
              if(arg == meridians[i][0] )
                {
                  temp = meridians[i] ;
                  break ;
                 }
              temp = ({ "NULL" }) ;
            }
      }
    return temp ;
}

//  傳入要抓之經絡的編號
string *query_meridians_by_no(int no)
{   
    return meridians[no] ;
}

string query_meridians_describ(int no)
{
    return merid_describ[no] ;
}

