//#pragma save_binary

#include <mudlib.h> 
#define ZOMBIE  "/d/monk/monster/zombie1.c"

inherit DAEMON;

string *ditung = ({
"三海之內，是大地獄，其數百千，各各差別。所謂大者，具有十八。\n"
"次有五百，苦毒無量。次有千百，亦無量苦。\n ",

"爾時百千萬億不可思、不可議、不可量、不可說無量阿僧祇世界，所有地獄\n"
"處，分身地藏菩薩，俱來集在忉利天宮。以如來神力故，各以方面，與諸解\n"
"脫，從業道出者，亦各有千萬億那由他數，共持香華，來供養佛。\n",

"彼諸同來等輩，皆因地藏菩薩教化，永不退轉於阿耨多羅三藐三菩提。\n"
"是諸眾等，久遠劫來，流浪生死，六道受苦，暫無休息。以地藏菩薩廣\n"
"大慈悲，深誓願故，各獲果證。既至忉利，心懷踴躍，瞻仰如來，目不暫舍。\n",

"汝觀吾累劫勤苦度脫如是等，難化剛強罪苦眾生。其有未調伏者，隨業報應。\n"
"若墮惡趣，受大苦時，汝當憶念吾在忉利天宮殷勤付囑，令娑婆世界至彌勒出世\n"
"已來眾生，悉使解脫，永離諸苦，遇佛受記。』\n",

"千萬世界，乃及國土，或有地獄、或無地獄；或有女人、或無女人；\n"
"或有佛法、或無佛法，乃至聲聞辟支佛，亦復如是，非但地獄罪報一等。\n",

"地藏菩薩白言：『聖母，諸有地獄在大鐵圍山之內，其大地獄有一十八所\n"
"名號各別，獨有一獄，名曰無間，其獄周匝萬八千里，獄牆高一千里，\n"
"悉是鐵圍，上火徹下，下火徹上。鐵蛇鐵狗，吐火馳逐獄牆之上，東西而走。\n",

"獄中有床，遍滿萬里。一人受罪，自見其身遍臥滿床。千萬人受罪，亦\n"
"各自見身滿床上。眾業所感獲報如是。又諸罪人，備受眾苦。百千夜叉\n"
"及以惡鬼，口牙如劍，眼如電光，手復銅爪，拖拽罪人。復有夜叉執大\n"
"鐵戟，中罪人身，或中口鼻，或中腹背。復有鐵蛇絞罪人頸。\n",

"此界壞時，轉寄他方；他方壞時，輾轉相寄。此界成後，還復而來。無間\n"
"罪報，其事如是。\n",

"又五事業感，故稱無間。何等為五？\n"
"    一者、日夜受罪，以至劫數，無時間絕，故稱無間。\n"
"    二者、一人亦滿，多人亦滿，故稱無間。\n"
"    三者、罪器叉棒，鷹蛇狼犬，碓磨鋸鑿，剉斫鑊湯，鐵網鐵繩，鐵驢鐵\n"
"          馬，生革絡首，熱鐵澆身，飢吞鐵丸，渴飲鐵汁，從年竟劫，數\n"
"          那由他，苦楚相連，更無間斷，故稱無間。\n"
"    四者、不問男子女人，羌胡夷狄，老幼貴賤，或龍或神，或天或鬼，罪\n"
"          行業感，悉同受之，故稱無間。\n"
"    五者、若墮此獄，從初入時，至百千劫，一日一夜，萬死萬生，求一念\n"
"          間暫住不得，除非業盡，方得受生，以此連綿，故稱無間。』\n",

"爾時地藏菩薩摩訶薩白佛言：『世尊，我承佛如來威神力故，遍百千萬億世\n"
"界，分是身形，救拔一切業報眾生。若非如來大慈力故，即不能作如是變化\n"
"。我今又蒙佛付囑，至阿逸多成佛以來，六道眾生，遣令度脫。唯然世尊，\n"
"願不有慮。』\n",

"爾時佛告地藏菩薩：『一切眾生未解脫者，性識無定，惡習結業，善習結\n"
"果。為善為惡，逐境而生。轉輪五道，暫無休息，動經塵劫，迷惑障難。\n"
"如魚遊網。將是長流，脫入暫出，又復遭網。以是等輩，吾當憂念。汝既\n"
"畢是往願，累劫重誓，廣度罪輩，吾復何慮。』\n",

"『復於過去無量阿僧祇劫，有佛出世，名清淨蓮華目如來，其佛壽命四十\n"
"劫。像法之中，有一羅漢，福度眾生。因次教化，遇一女人，字曰光目，\n"
"設食供養。』\n",

"『發誓願已，具聞清淨蓮華目如來而告之曰：「光目，汝大慈愍，善能為\n"
"母發如是大願。吾觀汝母十三歲畢，捨此報已，生為梵志，壽年百歲。過\n"
"是報後，當生無憂國土，壽命不可計劫。後成佛果，廣度人天，數如恆河\n"
"沙。」\n",

"佛告定自在王：『爾時羅漢福度光目者，即無盡意菩薩是。光目女者，即\n"
"地藏菩薩是。過去久遠劫中，如是慈愍，發恆河沙願，廣度眾生。未來世\n"
"中，若有男子女人，不行善者行惡者，乃至不信因果者，邪淫妄語者兩舌\n"
"惡口者，毀謗大乘者，如是諸業眾生，必墮惡趣。\n",

"佛告四天王：『地藏菩薩久遠劫來，迄至於今，度脫眾生，猶未畢願，慈\n"
"愍此世罪苦眾生。復觀未來無量劫中，因蔓不斷，以是之故，又發重願。\n"
"如是菩薩於娑婆世界，閻浮提中，百千萬億方便，而為教化。四天王，地\n"
"藏菩薩:\n"
"        若遇殺生者，            說宿殃短命報。\n"
"        若遇竊盜者，            說貧窮苦楚報。\n"
"        若遇邪淫者，            說雀鴿鴛鴦報。\n"
"        若遇惡口者，            說眷屬鬥諍報。\n"
"        若遇毀謗者，            說無舌瘡口報。\n"
"        若遇瞋恚者，            說醜陋聾殘報。\n"
"        若遇慳吝者，            說所求違願報。\n"
"        若遇飲食無度者，        說飢渴咽病報。\n"
"        若遇畋獵恣情者，        說驚狂喪命報。\n"
"        若遇悖逆父母者，        說天地災殺報。\n"
"        若遇燒山林木者，        說狂迷取死報。\n"
"        若遇前後父母惡毒者，    說返生鞭撻現受報。\n"
"        若遇網捕生雛者，        說骨肉分離報。\n"
"        若遇毀謗三寶者，        說盲聾瘖啞報。\n"
"        若遇輕法慢教者，        說永處惡道報。\n"
"        若遇破用常住者，        說億劫輪迴地獄報。\n"
"        若遇汙梵誣僧者，        說永在畜生報。\n"
"        若遇湯火斬斫傷者，      說輪迴遞償報。\n"
"        若遇破戒犯齋者，        說禽獸飢惡報。\n"
"        若遇非理毀用者，        說所求闕絕報。\n"
"        若遇吾我貢高者，        說卑使下賤報。\n"
"        若遇兩舌鬥亂者，        說無舌百舌報。\n"
"        若遇邪見者，            說邊地受生報。\n",

"『如是等閻浮提眾生，身口意業，惡息結果，百千報應，今粗略說。如\n"
"是等閻浮提眾生業感差別，地藏菩薩百千方便而教化之。是諸眾生，先\n"
"受如是等報，後墮地獄，動經劫數，無有出期。是故汝等護人護國，無\n"
"令是諸眾業迷惑眾生。』\n",

"    南無常住十方佛\n"
"    南無常住十方佛\n"
"    南無常住十方佛\n",

"        有大地獄，號極無間，    又有地獄，名大阿鼻，\n"
"        復有地獄，名曰四角，    復有地獄，名曰飛刀，\n"
"        復有地獄，名曰火箭，    復有地獄，名曰夾山，\n"
"        復有地獄，名曰通槍，    復有地獄，名曰鐵車，\n"
"        復有地獄，名曰鐵床，    復有地獄，名曰鐵牛，\n"
"        復有地獄，名曰鐵衣，    復有地獄，名曰千刃，\n"
"        復有地獄，名曰鐵驢，    復有地獄，名曰烊銅，\n"
"        復有地獄，名曰抱柱，    復有地獄，名曰流火，\n"
"        復有地獄，名曰耕舌，    復有地獄，名曰剉首，\n"
"        復有地獄，名曰燒腳，    復有地獄，名曰啗眼，\n"
"        復有地獄，名曰鐵丸，    復有地獄，名曰諍論，\n"
"        復有地獄，名曰鐵鈇，    復有地獄，名曰多瞋。\n",

"        叫喚地獄，      拔舌地獄，      糞尿地獄，\n"
"        銅鎖地獄，      火象地獄，      火狗地獄，\n"
"        火馬地獄，      火牛地獄，      火山地獄，\n"
"        火石地獄，      火床地獄，      火梁地獄，\n"
"        火鷹地獄，      鋸牙地獄，      剝皮地獄，\n"
"        飲血地獄，      燒手地獄，      燒腳地獄，\n"
"        倒刺地獄，      火屋地獄，      鐵屋地獄，\n"
"        火狼地獄，      如是等地獄。\n",

"地藏菩薩告普賢菩薩言：『仁者，此者皆是南閻浮提行惡眾生，業感如\n"
"是。業力甚大，能敵須彌，能深巨海，能障聖道。是故眾生莫輕小惡，\n"
"以為無罪，死後有報，纖毫受之。父子至親，歧路各別，縱然相逢，無\n"
"肯代受。我今承佛威力，略說地獄罪報之事，唯願仁者暫聽是言。』\n",

"        或有地獄，取罪人心，夜叉食之。\n"
"        或有地獄，鑊湯盛沸，煮罪人身。\n"
"        或有地獄，赤燒銅柱，使罪人抱。\n"
"        或有地獄，使諸火燒，趁及罪人。\n"
"        或有地獄，一向寒冰。\n"
"        或有地獄，無限糞尿。\n"
"        或有地獄，純飛鈒鑗。\n"
"        或有地獄，多攢火槍。\n"
"        或有地獄，唯撞胸背。\n"
"        或有地獄，但燒手足。\n"
"        或有地獄，盤絞鐵蛇。\n"
"        或有地獄，驅逐鐵狗。\n",

"仁者，如是等報，各各獄中，有百千種業道之器，無非是銅是鐵，是石\n"
"是火，此四種物，眾業行感。若廣說地獄罪報等事，一一獄中更有百千\n"
"種苦楚，何況多獄。我今承佛威神及仁者問，略說如是。若廣解說，窮\n"
"劫不盡。\n" });

int help();

int cmd_sac(string str)
{
	string text, name;
	int skill, exp, level, n;
	object targ, env, me, zombie;
	
	if( str ) return help();
	me = this_player();
	env = environment(me);
	if( !env || !targ = present("corpse", env) )
		return notify_fail("這裡沒有任何屍體啊! 你要超度誰啊!\n");
	if(userp(targ)) return notify_fail("這東西還活著, 不能超度!\n");
	skill = (int)this_player()->query_skill("recitation");
	if( !skill ) return notify_fail("你沒有學過誦經，你不懂如何超渡死者。\n");

	if( (skill/2 + 50) > random( 111+skill/5 ) ) {
		text = ditung[random(sizeof(ditung))];
		tell_object( me, 
			"你雙目微閉，翻開手中的地藏經喃喃的念著....\n\n"+set_color(text, "HIY", me)+
			"\n"+targ->query("short")+"中飄起一股白煙，它微笑著向你點個頭而後"+
			"飛向西方極樂世界。\n" );
		tell_room( env, 
			me->query("c_name")+"雙目微閉，翻開手中的地藏經喃喃的念著..\n\n"+
			set_color(text, "HIY", me)+"\n"+targ->query("short")+
			"中飄起一股白煙，它微笑著向你點個頭而後飛向西方極樂世界。\n" , me );
		exp = 5 + random(11);
		me->gain_experience(exp);
		write("你由於超度成功獲得了 "+exp+" 個經驗點數 \n");
		targ->remove();
	} else if( (int)me->query_level() < 8 || random(8) < 4 ) {
		tell_room( environment(me), 
			set_color(targ->query("short")+"爬起來向"+me->query("c_name")+"大罵說\n"+
			"「讓你這種連地藏經都不熟的和尚超渡真倒楣啊! 我真是死不瞑目! 」\n\n"+
			targ->query("short")+"中飄起一道亡魂，它很不爽的飄向荒郊野外，成"
			"了孤魂野鬼。\n", "HIM", me) );
		targ->remove();
	} else {
		tell_room( environment(me), 
			set_color(targ->query("short")+"爬起來向"+me->query("c_name")+"說\n"
			"『 來吧! 你這個亂超渡死人的臭和尚，跟我到地獄去吧! 嘿嘿嘿.... 』\n\n"+
			targ->query("short")+"突然爬了起來，它伸直雙手跳向你....\n"
			"哇! 是僵屍啊!\n", "HIG", me) ); 


	switch( n = random(3) ) {
		case 0: name = "zombie3";		break;
		case 1: name = "zombie2";		break;
		case 2: name = "zombie1";		break;
	}
		zombie = new( "/d/monk/monster/" + name );
		zombie->set_zombie( targ );
		zombie->move( env );
		zombie->kill_ob(me);
		targ->remove();
	}
	return 1;
}

int help()
{
		write( @C_HELP
指令格式: sac 

這個指令讓你用來超度亡魂... 不需要任何參數!  

C_HELP
		);

    return 1;
}
