#include <../mumar.h>
inherit "/d/eastland/mumar/mumar_army";
 
void create()
{
        object ob1;
 
        ::create();
        set_level(5);
        set_name( "old soldier", "老兵" );
        add( "id", ({ "soldier" }) );
        set_short( "老兵" );
        set_long(
  "你看到一個滿身是疤的老兵，正坐在一個帳蓬旁整理東西，以他對牧馬關的瞭解，\n"
  "你有問題或想打聽誰的事，問他是錯不了的。\n"
        );
        set( "gender", "male" );
        set( "alignment", 200 );
        set( "wealth/silver", 50 );
        set( "natural_armor_class", 25 );
        set( "natural_defense_bonus", 10 );
        set_natural_weapon( 2, 1, 1 );
        set_perm_stat( "str", 5 );
        set_perm_stat( "dex", 7 );
        set_skill( "dodge", 50 );
 
        ob1 = new( OBJS"dagger1" );
        ob1->move(this_object());
        wield_weapon(ob1);
        set( "inquiry", ([
 "soldier" : ({ "嗯...俺聽說有個小兵偷了武器庫裡的東西跑了，俺是不清楚他偷了啥\n"
                "玩意啦，不過軍師最近幾天都在庫房裡清點東西，好像很緊張的樣子。\n" }),
 "rat" : ({ "嗯...說到老鼠...俺那天看到一隻大老鼠背著一袋米跑出伙房，那畜生\n"
            "一看到我就跑回伙房去了，可是我和伙伕們找了好久就是找不到。如果我再遇到，\n"
            "我非好好教訓教訓它不可。\n" }),
 "lee" : ({ "李將軍是我們的大家長啊...雖然聽說他是靠他老婆才爬到這個地位，\n"
            "但是他功夫還真不錯。我當那麼久的兵，還是第一次看到有這麼強的節度使。\n"
            "不過，我也是第一次看到這麼愛收集古董的年輕人。\n"}),
 "master" : ({ "嗯...那個教頭啊....實在有夠臭屁的...不想提他...\n"}),
 "advisor" : ({ "嗯...這個軍師啊...最近好像在為一個逃兵(soldier)而忙著呢!!\n" }),
 "guard" : ({ "嗯...守衛都是很盡忠職守的...只有像我這樣的夠老的兵才能擔任喔..\n" }),
 "groom" : ({ "嗯...那個馬伕啊..最討厭有人騎馬跑進馬房，不過如果你有令牌(mark)的話，\n"
              "他應該也會讓你幾分。\n" }),
 "mark" : ({ "嗯...令牌啊...我只知道那個金光閃閃的東西在將軍身上。\n" }),
 "hen" : ({ "嗯...哼將軍是個剛正不阿的傢伙，整個人冷冰冰的，弟兄們傳說他很怕熱。\n" }),
 "ha" : ({ "嗯...哈將軍是個熱情如火卻很邋塌的人..弟兄們傳說他很怕冷。\n" }),
 "indra" : ({ "嗯...那個雷神之子啊...是個有名的色狼巫師。\n" }),
 "stasia" : ({ "嗯...小雅是個美女...雖然大家都說她身材不是很好...我上次見到她時仔細\n"
               "看了一下，其實也不差嘛。\n" }),
 "ruby" : ({ "嗯...茹比我見過幾次...他是個好人....\n"  }),
 "fos" : ({ "嗯...Fos是有名的花花公子...女生看到他是要小心......\n"
            "不過他看起來應該會是個好丈夫。\n"  })
      ]) );
}
